app/controllers/api/shipments_controller.rb

INSERT INTO "origins" ("city", "state", "load_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["city", "São paulo"], ["state", "SP"], ["load_at", "2017-09-25"], ["created_at", "2017-10-02 21:14:12.814796"], ["updated_at", "2017-10-02 21:14:12.814796"]]
INSERT INTO "destinations" ("city", "state", "deliver_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["city", "Goiânia"], ["state", "GO"], ["deliver_at", "2017-09-29"], ["created_at", "2017-10-02 21:14:12.894025"], ["updated_at", "2017-10-02 21:14:12.894025"]]
INSERT INTO "contacts" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Osvaldo"], ["phone", "(11) 98268-4321"], ["created_at", "2017-10-02 21:14:12.766123"], ["updated_at", "2017-10-02 21:14:12.766123"]]
INSERT INTO "shipments" ("value", "weight_kg", "contact_id", "origin_id", "destination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["value", 1500.0], ["weight_kg", 2000], ["contact_id", 1], ["origin_id", 1], ["destination_id", 1], ["created_at", "2017-10-02 21:14:12.966751"], ["updated_at", "2017-10-02 21:14:12.966751"]]
INSERT INTO "vehicles" ("vtype", "body_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vtype", "Truck"], ["body_type", "Sider"], ["created_at", "2017-10-02 21:14:13.005937"], ["updated_at", "2017-10-02 21:14:13.005937"]]
INSERT INTO "shipment_vehicles" ("vtype", "body_type", "shipment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["vtype", "Truck"], ["body_type", "Baú"], ["shipment_id", 8], ["created_at", "2017-10-02 21:49:04.013804"], ["updated_at", "2017-10-02 21:49:04.013804"]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 2]]
DELETE FROM "destinations" WHERE "destinations"."id" = $1  [["id", 43]]
DELETE FROM "origins" WHERE "origins"."id" = $1  [["id", 34]]
---
    def create
      origin = shipment_params[:origin]
      destination = shipment_params[:destination]
      contact = shipment_params[:contact]
      vehicles = shipment_params[:vehicles]

      @origin = Origin.new(origin)
      if @origin.save
        @destination = Destination.new(destination)
        if @destination.save
          @contact = Contact.new(contact)
          if @contact.save
            @shipment = Shipment.new(value: shipment_params[:value],
                                     weight_kg: shipment_params[:weight_kg],
                                     contact: @contact,
                                     origin: @origin,
                                     destination: @destination)
            if @shipment.save
              (0..(vehicles.count - 1)).each do |i|
                @vehicle = mantemVehicle(vehicles[i][:type],
                                         vehicles[i][:body_type])
                if !@vehicle.nil?
                  @vehicle.save
                  @ship_veh = ShipmentVehicle.new(shipment: @shipment,
                                                  vehicle: @vehicle)
                  @ship_veh.save
                else
                  @shipment.destroy
                  @contact.destroy
                  @destination.destroy
                  @origin.destroy

SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @ship = Shipment.find(params[:id])

SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "truckers".* FROM "truckers" WHERE "truckers"."last_state" = ? AND "truckers"."last_city" = ?  [["last_state", "AC"], ["last_city", "Rio Branco"]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    def nearby_truckers
      @shipment = Shipment.find(params[:id])
      city = @shipment.origin.city
      state = @shipment.origin.state
      vehicles = ShipmentVehicle.where(shipment_id: params[:id]).select(:vehicle_id)

      truckers = Trucker.where(last_state: state, last_city: city, vehicle_id: vehicles[0][:vehicle_id])
      (1..(vehicles.count - 1)).each do |i|