app/controllers/api/truckers_controller.rb

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."vtype" = ? AND "vehicles"."body_type" = ? LIMIT ?  [["vtype", "Truck"], ["body_type", "Baú"], ["LIMIT", 1]]
INSERT INTO "vehicles" ("vtype", "body_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vtype", "Truck"], ["body_type", "Baú"], ["created_at", "2017-10-02 21:06:26.387769"], ["updated_at", "2017-10-02 21:06:26.387769"]]
INSERT INTO "truckers" ("name", "phone", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lincoln Falcão"], ["phone", "(11)5637-2817"], ["vehicle_id", 1], ["created_at", "2017-10-02 21:11:43.780310"], ["updated_at", "2017-10-02 21:11:43.780310"]]
---
	def create
		trucker = params.require(:trucker).permit(:name, :phone, {vehicle: [:type, :body_type]})
		vehicle = trucker[:vehicle]

		resp = Vehicle.find_by(vtype: vehicle[:type], body_type: vehicle[:body_type])
		if resp
			id = resp.id
			p "Usou o velho"
		else
			novo = Vehicle.new(vtype: vehicle[:type], body_type: vehicle[:body_type])
			novo.save
			id = novo.id

			p "Criou novo"
		end

		trucker[:vehicle] = resp

		@trucker = Trucker.new(trucker)

	    if @trucker.save

SELECT  "truckers".* FROM "truckers" WHERE "truckers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "truckers" SET "last_city" = ?, "last_state" = ?, "updated_at" = ? WHERE "truckers"."id" = ?  [["last_city", "São paulo"], ["last_state", "SP"], ["updated_at", "2017-10-02 20:04:25.431339"], ["id", 1]]
---
	def last_location
		trucker = Trucker.find(params[:id])
		location = params.require(:location).permit(:city, :state)
		trucker.last_city = location[:city]
		trucker.last_state = location[:state]
		trucker.save

SELECT "truckers".* FROM "truckers"
---
	def index
		@trucker = Trucker.all