app/controllers/api/truckers_controller.rb

	  def create
	  	vehicle = trucker_params[:vehicle]

	    @vehicle = Vehicle.new(vtype: vehicle[:type],
	    					   body_type: vehicle[:body_type])
	    if @vehicle.save
			@trucker = Trucker.new(name: trucker_params[:name],
								   phone: trucker_params[:phone],
								   vehicle: @vehicle)
			if @trucker.save
				render status: :created,
				location: [:api, @trucker],
				content_type: "application/json"
			else
				@vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 10]]